ARMmbed/DAPLink/source/hif_hal/freescale/iap/devices/MK20D5/MK20D5_extension.h
/*
** ###################################################################
**     Compilers:           Keil ARM C/C++ Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          GNU C Compiler - CodeSourcery Sourcery G++
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    K20P64M50SF0RM Rev. 1, Oct 2011
**     Version:             rev. 2.1, 2013-06-24
**     Build:               b150215
**
**     Abstract:
**         Extension to the CMSIS register access layer header.
**
**     Copyright (c) 2013 Freescale Semiconductor, Inc.
**     All rights reserved.
**
**     Redistribution and use in source and binary forms, with or without modification,
**     are permitted provided that the following conditions are met:
**
**     o Redistributions of source code must retain the above copyright notice, this list
**       of conditions and the following disclaimer.
**
**     o Redistributions in binary form must reproduce the above copyright notice, this
**       list of conditions and the following disclaimer in the documentation and/or
**       other materials provided with the distribution.
**
**     o Neither the name of Freescale Semiconductor, Inc. nor the names of its
**       contributors may be used to endorse or promote products derived from this
**       software without specific prior written permission.
**
**     THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
**     ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
**     WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
**     DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
**     ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
**     (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
**     LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
**     ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
**     (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
**     SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 1.0 (2011-12-15)
**         Initial version
**     - rev. 2.0 (2012-03-19)
**         PDB Peripheral register structure updated.
**         DMA Registers and bits for unsupported DMA channels removed.
**     - rev. 2.1 (2013-06-24)
**         NV_FOPT register - NMI_DIS bit added.
**
** ###################################################################
*/

/*
 * WARNING! DO NOT EDIT THIS FILE DIRECTLY!
 *
 * This file was generated automatically and any changes may be lost.
 */
#ifndef __MK20D5_EXTENSION_H__
#define __MK20D5_EXTENSION_H__

#include "MK20D5.h"
#include "fsl_bitaccess.h"

/*
 * MK20D5 ADC
 *
 * Analog-to-Digital Converter
 *
 * Registers defined in this header file:
 * - ADC_SC1 - ADC status and control registers 1
 * - ADC_CFG1 - ADC configuration register 1
 * - ADC_CFG2 - Configuration register 2
 * - ADC_R - ADC data result register
 * - ADC_CV1 - Compare value registers
 * - ADC_CV2 - Compare value registers
 * - ADC_SC2 - Status and control register 2
 * - ADC_SC3 - Status and control register 3
 * - ADC_OFS - ADC offset correction register
 * - ADC_PG - ADC plus-side gain register
 * - ADC_MG - ADC minus-side gain register
 * - ADC_CLPD - ADC plus-side general calibration value register
 * - ADC_CLPS - ADC plus-side general calibration value register
 * - ADC_CLP4 - ADC plus-side general calibration value register
 * - ADC_CLP3 - ADC plus-side general calibration value register
 * - ADC_CLP2 - ADC plus-side general calibration value register
 * - ADC_CLP1 - ADC plus-side general calibration value register
 * - ADC_CLP0 - ADC plus-side general calibration value register
 * - ADC_CLMD - ADC minus-side general calibration value register
 * - ADC_CLMS - ADC minus-side general calibration value register
 * - ADC_CLM4 - ADC minus-side general calibration value register
 * - ADC_CLM3 - ADC minus-side general calibration value register
 * - ADC_CLM2 - ADC minus-side general calibration value register
 * - ADC_CLM1 - ADC minus-side general calibration value register
 * - ADC_CLM0 - ADC minus-side general calibration value register
 */

#define ADC_INSTANCE_COUNT (1U) /*!< Number of instances of the ADC module. */
#define ADC0_IDX (0U) /*!< Instance number for ADC0. */

/*******************************************************************************
 * ADC_SC1 - ADC status and control registers 1
 ******************************************************************************/

/*!
 * @brief ADC_SC1 - ADC status and control registers 1 (RW)
 *
 * Reset value: 0x0000001FU
 *
 * The SC1A register is used for both software and hardware trigger modes of
 * operation. To allow sequential conversions of the ADC to be triggered by internal
 * peripherals, the ADC can have more then one status and control register: one
 * for each conversion. The SC1B-SC1n registers indicate potentially multiple SC1
 * registers for use only in hardware trigger mode. Refer to the Chip
 * Configuration information about the number of SC1n registers specific to this device.
 * The SC1n registers have identical fields, and are used in a "ping-pong" approach
 * to control ADC operation. At any one point in time, only one of the SC1n
 * registers is actively controlling ADC conversions. Updating SC1A while SC1n is
 * actively controlling a conversion is allowed (and vice-versa for any of the SC1n
 * registers specific to this MCU). Writing SC1A while SC1A is actively
 * controlling a conversion aborts the current conversion. In software trigger mode
 * (ADTRG=0), writes to the SC1A register subsequently initiate a new conversion (if
 * the ADCH bits are equal to a value other than all 1s). Similarly, writing any of
 * the SC1n registers while that specific SC1n register is actively controlling
 * a conversion aborts the current conversion. None of the SC1B-SC1n registers
 * are used for software trigger operation and therefore writes to the SC1B - SC1n
 * registers do not initiate a new conversion.
 */
/*!
 * @name Constants and macros for entire ADC_SC1 register
 */
/*@{*/
#define ADC_RD_SC1(base, index)  (ADC_SC1_REG(base, index))
#define ADC_WR_SC1(base, index, value) (ADC_SC1_REG(base, index) = (value))
#define ADC_RMW_SC1(base, index, mask, value) (ADC_WR_SC1(base, index, (ADC_RD_SC1(base, index) & ~(mask)) | (value)))
#define ADC_SET_SC1(base, index, value) (ADC_WR_SC1(base, index, ADC_RD_SC1(base, index) |  (value)))
#define ADC_CLR_SC1(base, index, value) (ADC_WR_SC1(base, index, ADC_RD_SC1(base, index) & ~(value)))
#define ADC_TOG_SC1(base, index, value) (ADC_WR_SC1(base, index, ADC_RD_SC1(base, index) ^  (value)))
/*@}*/

