ARMmbed/DAPLink/source/hif_hal/freescale/iap/devices/MK20D5/MK20D5_extension.h
/*
 * Constants & macros for individual CMT_PPS bitfields
 */

/*!
 * @name Register CMT_PPS, field PPSDIV[3:0] (RW)
 *
 * The primary prescaler divides the CMT clock to generate the Intermediate
 * Frequency clock enable to the secondary prescaler.
 *
 * Values:
 * - 0000 - Bus Clock * 1
 * - 0001 - Bus Clock * 2
 * - 0010 - Bus Clock * 3
 * - 0011 - Bus Clock * 4
 * - 0100 - Bus Clock * 5
 * - 0101 - Bus Clock * 6
 * - 0110 - Bus Clock * 7
 * - 0111 - Bus Clock * 8
 * - 1000 - Bus Clock * 9
 * - 1001 - Bus Clock * 10
 * - 1010 - Bus Clock * 11
 * - 1011 - Bus Clock * 12
 * - 1100 - Bus Clock * 13
 * - 1101 - Bus Clock * 14
 * - 1110 - Bus Clock * 15
 * - 1111 - Bus Clock * 16
 */
/*@{*/
/*! @brief Read current value of the CMT_PPS_PPSDIV field. */
#define CMT_RD_PPS_PPSDIV(base) ((CMT_PPS_REG(base) & CMT_PPS_PPSDIV_MASK) >> CMT_PPS_PPSDIV_SHIFT)
#define CMT_BRD_PPS_PPSDIV(base) (CMT_RD_PPS_PPSDIV(base))

/*! @brief Set the PPSDIV field to a new value. */
#define CMT_WR_PPS_PPSDIV(base, value) (CMT_RMW_PPS(base, CMT_PPS_PPSDIV_MASK, CMT_PPS_PPSDIV(value)))
#define CMT_BWR_PPS_PPSDIV(base, value) (CMT_WR_PPS_PPSDIV(base, value))
/*@}*/

/*******************************************************************************
 * CMT_DMA - CMT Direct Memory Access
 ******************************************************************************/

/*!
 * @brief CMT_DMA - CMT Direct Memory Access (RW)
 *
 * Reset value: 0x00U
 *
 * This register is used to enable/disable direct memory access (DMA).
 */
/*!
 * @name Constants and macros for entire CMT_DMA register
 */
/*@{*/
#define CMT_RD_DMA(base)         (CMT_DMA_REG(base))
#define CMT_WR_DMA(base, value)  (CMT_DMA_REG(base) = (value))
#define CMT_RMW_DMA(base, mask, value) (CMT_WR_DMA(base, (CMT_RD_DMA(base) & ~(mask)) | (value)))
#define CMT_SET_DMA(base, value) (CMT_WR_DMA(base, CMT_RD_DMA(base) |  (value)))
#define CMT_CLR_DMA(base, value) (CMT_WR_DMA(base, CMT_RD_DMA(base) & ~(value)))
#define CMT_TOG_DMA(base, value) (CMT_WR_DMA(base, CMT_RD_DMA(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CMT_DMA bitfields
 */

/*!
 * @name Register CMT_DMA, field DMA[0] (RW)
 *
 * This bit enables the DMA protocol.
 *
 * Values:
 * - 0 - DMA transfer request and done are disabled
 * - 1 - DMA transfer request and done are enabled
 */
/*@{*/
/*! @brief Read current value of the CMT_DMA_DMA field. */
#define CMT_RD_DMA_DMA(base) ((CMT_DMA_REG(base) & CMT_DMA_DMA_MASK) >> CMT_DMA_DMA_SHIFT)
#define CMT_BRD_DMA_DMA(base) (BITBAND_ACCESS8(&CMT_DMA_REG(base), CMT_DMA_DMA_SHIFT))

/*! @brief Set the DMA field to a new value. */
#define CMT_WR_DMA_DMA(base, value) (CMT_RMW_DMA(base, CMT_DMA_DMA_MASK, CMT_DMA_DMA(value)))
#define CMT_BWR_DMA_DMA(base, value) (BITBAND_ACCESS8(&CMT_DMA_REG(base), CMT_DMA_DMA_SHIFT) = (value))
/*@}*/

/*
 * MK20D5 CRC
 *
 * Cyclic Redundancy Check
 *
 * Registers defined in this header file:
 * - CRC_CRCL - CRC_CRCL register.
 * - CRC_CRCH - CRC_CRCH register.
 * - CRC_CRCLL - CRC_CRCLL register.
 * - CRC_CRCLU - CRC_CRCLU register.
 * - CRC_CRCHL - CRC_CRCHL register.
 * - CRC_CRCHU - CRC_CRCHU register.
 * - CRC_CRC - CRC Data Register
 * - CRC_GPOLY - CRC Polynomial Register
 * - CRC_GPOLYL - CRC_GPOLYL register.
 * - CRC_GPOLYH - CRC_GPOLYH register.
 * - CRC_GPOLYLL - CRC_GPOLYLL register.
 * - CRC_GPOLYLU - CRC_GPOLYLU register.
 * - CRC_GPOLYHL - CRC_GPOLYHL register.
 * - CRC_GPOLYHU - CRC_GPOLYHU register.
 * - CRC_CTRL - CRC Control Register
 * - CRC_CTRLHU - CRC_CTRLHU register.
 */

#define CRC_INSTANCE_COUNT (1U) /*!< Number of instances of the CRC module. */
#define CRC_IDX (0U) /*!< Instance number for CRC. */

/*******************************************************************************
 * CRC_CRCLL - CRC_CRCLL register.
 ******************************************************************************/

/*!
 * @brief CRC_CRCLL - CRC_CRCLL register. (RW)
 *
 * Reset value: 0xFFU
 */
/*!
 * @name Constants and macros for entire CRC_CRCLL register
 */
/*@{*/
#define CRC_RD_CRCLL(base)       (CRC_CRCLL_REG(base))
#define CRC_WR_CRCLL(base, value) (CRC_CRCLL_REG(base) = (value))
#define CRC_RMW_CRCLL(base, mask, value) (CRC_WR_CRCLL(base, (CRC_RD_CRCLL(base) & ~(mask)) | (value)))
#define CRC_SET_CRCLL(base, value) (CRC_WR_CRCLL(base, CRC_RD_CRCLL(base) |  (value)))
#define CRC_CLR_CRCLL(base, value) (CRC_WR_CRCLL(base, CRC_RD_CRCLL(base) & ~(value)))
#define CRC_TOG_CRCLL(base, value) (CRC_WR_CRCLL(base, CRC_RD_CRCLL(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * CRC_CRCL - CRC_CRCL register.
 ******************************************************************************/

/*!
 * @brief CRC_CRCL - CRC_CRCL register. (RW)
 *
 * Reset value: 0xFFFFU
 */
/*!
 * @name Constants and macros for entire CRC_CRCL register
 */
/*@{*/
#define CRC_RD_CRCL(base)        (CRC_CRCL_REG(base))
#define CRC_WR_CRCL(base, value) (CRC_CRCL_REG(base) = (value))
#define CRC_RMW_CRCL(base, mask, value) (CRC_WR_CRCL(base, (CRC_RD_CRCL(base) & ~(mask)) | (value)))
#define CRC_SET_CRCL(base, value) (CRC_WR_CRCL(base, CRC_RD_CRCL(base) |  (value)))
#define CRC_CLR_CRCL(base, value) (CRC_WR_CRCL(base, CRC_RD_CRCL(base) & ~(value)))
#define CRC_TOG_CRCL(base, value) (CRC_WR_CRCL(base, CRC_RD_CRCL(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * CRC_CRC - CRC Data Register
 ******************************************************************************/

/*!
 * @brief CRC_CRC - CRC Data Register (RW)
 *
 * Reset value: 0xFFFFFFFFU
 *
 * The CRC data register contains the value of the seed, data, and checksum.
 * When the CTRL[WAS] bit is set, any write to the data register is regarded as the
 * seed value. When the CTRL[WAS] bit is cleared, any write to the data register
 * is regarded as data for general CRC computation. In 16-bit CRC mode, the HU
 * and HL fields are not used for programming the seed value, and reads of these
 * fields return an indeterminate value. In 32-bit CRC mode, all fields are used
 * for programming the seed value. When programming data values, the values can be
 * written 8 bits, 16 bits, or 32 bits at a time, provided all bytes are
 * contiguous; with MSB of data value written first. After all data values are written,
 * the CRC result can be read from this data register. In 16-bit CRC mode, the CRC
 * result is available in the LU and LL fields. In 32-bit CRC mode, all fields
 * contain the result. Reads of this register at any time return the intermediate
 * CRC value, provided the CRC module is configured.
 */
/*!
 * @name Constants and macros for entire CRC_CRC register
 */
/*@{*/
#define CRC_RD_CRC(base)         (CRC_CRC_REG(base))
#define CRC_WR_CRC(base, value)  (CRC_CRC_REG(base) = (value))
#define CRC_RMW_CRC(base, mask, value) (CRC_WR_CRC(base, (CRC_RD_CRC(base) & ~(mask)) | (value)))
#define CRC_SET_CRC(base, value) (CRC_WR_CRC(base, CRC_RD_CRC(base) |  (value)))
#define CRC_CLR_CRC(base, value) (CRC_WR_CRC(base, CRC_RD_CRC(base) & ~(value)))
#define CRC_TOG_CRC(base, value) (CRC_WR_CRC(base, CRC_RD_CRC(base) ^  (value)))
/*@}*/

