ARMmbed/DAPLink/source/hif_hal/freescale/iap/devices/MK20D5/MK20D5_extension.h
/*******************************************************************************
 * FMC_TAGVD - Cache Tag Storage
 ******************************************************************************/

/*!
 * @brief FMC_TAGVD - Cache Tag Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The 32-entry cache is a 4-way, set-associative cache with 2 sets. The ways
 * are numbered 0-3 and the sets are numbered 0-1. In TAGVDWxSy, x denotes the way,
 * and y denotes the set. This section represents tag/vld information for the 2
 * sets (n=0-1) in way 0.
 */
/*!
 * @name Constants and macros for entire FMC_TAGVD register
 */
/*@{*/
#define FMC_RD_TAGVD(base, index, index2) (FMC_TAGVD_REG(base, index, index2))
#define FMC_WR_TAGVD(base, index, index2, value) (FMC_TAGVD_REG(base, index, index2) = (value))
#define FMC_RMW_TAGVD(base, index, index2, mask, value) (FMC_WR_TAGVD(base, index, index2, (FMC_RD_TAGVD(base, index, index2) & ~(mask)) | (value)))
#define FMC_SET_TAGVD(base, index, index2, value) (FMC_WR_TAGVD(base, index, index2, FMC_RD_TAGVD(base, index, index2) |  (value)))
#define FMC_CLR_TAGVD(base, index, index2, value) (FMC_WR_TAGVD(base, index, index2, FMC_RD_TAGVD(base, index, index2) & ~(value)))
#define FMC_TOG_TAGVD(base, index, index2, value) (FMC_WR_TAGVD(base, index, index2, FMC_RD_TAGVD(base, index, index2) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FMC_TAGVD bitfields
 */

/*!
 * @name Register FMC_TAGVD, field valid[0] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVD_valid field. */
#define FMC_RD_TAGVD_valid(base, index, index2) ((FMC_TAGVD_REG(base, index, index2) & FMC_TAGVD_valid_MASK) >> FMC_TAGVD_valid_SHIFT)
#define FMC_BRD_TAGVD_valid(base, index, index2) (BITBAND_ACCESS32(&FMC_TAGVD_REG(base, index, index2), FMC_TAGVD_valid_SHIFT))

/*! @brief Set the valid field to a new value. */
#define FMC_WR_TAGVD_valid(base, index, index2, value) (FMC_RMW_TAGVD(base, index, index2, FMC_TAGVD_valid_MASK, FMC_TAGVD_valid(value)))
#define FMC_BWR_TAGVD_valid(base, index, index2, value) (BITBAND_ACCESS32(&FMC_TAGVD_REG(base, index, index2), FMC_TAGVD_valid_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_TAGVD, field tag[18:6] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVD_tag field. */
#define FMC_RD_TAGVD_tag(base, index, index2) ((FMC_TAGVD_REG(base, index, index2) & FMC_TAGVD_tag_MASK) >> FMC_TAGVD_tag_SHIFT)
#define FMC_BRD_TAGVD_tag(base, index, index2) (FMC_RD_TAGVD_tag(base, index, index2))

/*! @brief Set the tag field to a new value. */
#define FMC_WR_TAGVD_tag(base, index, index2, value) (FMC_RMW_TAGVD(base, index, index2, FMC_TAGVD_tag_MASK, FMC_TAGVD_tag(value)))
#define FMC_BWR_TAGVD_tag(base, index, index2, value) (FMC_WR_TAGVD_tag(base, index, index2, value))
/*@}*/

/*******************************************************************************
 * FMC_DATAW0S - Cache Data Storage
 ******************************************************************************/

/*!
 * @brief FMC_DATAW0S - Cache Data Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of eight 32-bit entries is a 4-way, set-associative cache with 2
 * sets. The ways are numbered 0-3 and the sets are numbered 0-1. In DATAWxSy, x
 * denotes the way, and y denotes the set. This section represents data for bits
 * [31:0] of sets 0-1 in way 0.
 */
/*!
 * @name Constants and macros for entire FMC_DATAW0S register
 */
/*@{*/
#define FMC_RD_DATAW0S(base, index) (FMC_DATAW0S_REG(base, index))
#define FMC_WR_DATAW0S(base, index, value) (FMC_DATAW0S_REG(base, index) = (value))
#define FMC_RMW_DATAW0S(base, index, mask, value) (FMC_WR_DATAW0S(base, index, (FMC_RD_DATAW0S(base, index) & ~(mask)) | (value)))
#define FMC_SET_DATAW0S(base, index, value) (FMC_WR_DATAW0S(base, index, FMC_RD_DATAW0S(base, index) |  (value)))
#define FMC_CLR_DATAW0S(base, index, value) (FMC_WR_DATAW0S(base, index, FMC_RD_DATAW0S(base, index) & ~(value)))
#define FMC_TOG_DATAW0S(base, index, value) (FMC_WR_DATAW0S(base, index, FMC_RD_DATAW0S(base, index) ^  (value)))
/*@}*/

/*******************************************************************************
 * FMC_DATAW1S - Cache Data Storage
 ******************************************************************************/

/*!
 * @brief FMC_DATAW1S - Cache Data Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of eight 32-bit entries is a 4-way, set-associative cache with 2
 * sets. The ways are numbered 0-3 and the sets are numbered 0-1. In DATAWxSy, x
 * denotes the way, and y denotes the set. This section represents data for bits
 * [31:0] of sets 0-1 in way 1.
 */
/*!
 * @name Constants and macros for entire FMC_DATAW1S register
 */
/*@{*/
#define FMC_RD_DATAW1S(base, index) (FMC_DATAW1S_REG(base, index))
#define FMC_WR_DATAW1S(base, index, value) (FMC_DATAW1S_REG(base, index) = (value))
#define FMC_RMW_DATAW1S(base, index, mask, value) (FMC_WR_DATAW1S(base, index, (FMC_RD_DATAW1S(base, index) & ~(mask)) | (value)))
#define FMC_SET_DATAW1S(base, index, value) (FMC_WR_DATAW1S(base, index, FMC_RD_DATAW1S(base, index) |  (value)))
#define FMC_CLR_DATAW1S(base, index, value) (FMC_WR_DATAW1S(base, index, FMC_RD_DATAW1S(base, index) & ~(value)))
#define FMC_TOG_DATAW1S(base, index, value) (FMC_WR_DATAW1S(base, index, FMC_RD_DATAW1S(base, index) ^  (value)))
/*@}*/

/*******************************************************************************
 * FMC_DATAW2S - Cache Data Storage
 ******************************************************************************/

/*!
 * @brief FMC_DATAW2S - Cache Data Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of eight 32-bit entries is a 4-way, set-associative cache with 2
 * sets. The ways are numbered 0-3 and the sets are numbered 0-1. In DATAWxSy, x
 * denotes the way, and y denotes the set. This section represents data for bits
 * [31:0] of sets 0-1 in way 2.
 */
/*!
 * @name Constants and macros for entire FMC_DATAW2S register
 */
/*@{*/
#define FMC_RD_DATAW2S(base, index) (FMC_DATAW2S_REG(base, index))
#define FMC_WR_DATAW2S(base, index, value) (FMC_DATAW2S_REG(base, index) = (value))
#define FMC_RMW_DATAW2S(base, index, mask, value) (FMC_WR_DATAW2S(base, index, (FMC_RD_DATAW2S(base, index) & ~(mask)) | (value)))
#define FMC_SET_DATAW2S(base, index, value) (FMC_WR_DATAW2S(base, index, FMC_RD_DATAW2S(base, index) |  (value)))
#define FMC_CLR_DATAW2S(base, index, value) (FMC_WR_DATAW2S(base, index, FMC_RD_DATAW2S(base, index) & ~(value)))
#define FMC_TOG_DATAW2S(base, index, value) (FMC_WR_DATAW2S(base, index, FMC_RD_DATAW2S(base, index) ^  (value)))
/*@}*/

