ARMmbed/DAPLink/source/hif_hal/freescale/iap/devices/MK20D5/MK20D5_extension.h
/*******************************************************************************
 * FMC_DATAW3S - Cache Data Storage
 ******************************************************************************/

/*!
 * @brief FMC_DATAW3S - Cache Data Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of eight 32-bit entries is a 4-way, set-associative cache with 2
 * sets. The ways are numbered 0-3 and the sets are numbered 0-1. In DATAWxSy, x
 * denotes the way, and y denotes the set. This section represents data for bits
 * [31:0] of sets 0-1 in way 3.
 */
/*!
 * @name Constants and macros for entire FMC_DATAW3S register
 */
/*@{*/
#define FMC_RD_DATAW3S(base, index) (FMC_DATAW3S_REG(base, index))
#define FMC_WR_DATAW3S(base, index, value) (FMC_DATAW3S_REG(base, index) = (value))
#define FMC_RMW_DATAW3S(base, index, mask, value) (FMC_WR_DATAW3S(base, index, (FMC_RD_DATAW3S(base, index) & ~(mask)) | (value)))
#define FMC_SET_DATAW3S(base, index, value) (FMC_WR_DATAW3S(base, index, FMC_RD_DATAW3S(base, index) |  (value)))
#define FMC_CLR_DATAW3S(base, index, value) (FMC_WR_DATAW3S(base, index, FMC_RD_DATAW3S(base, index) & ~(value)))
#define FMC_TOG_DATAW3S(base, index, value) (FMC_WR_DATAW3S(base, index, FMC_RD_DATAW3S(base, index) ^  (value)))
/*@}*/

/*
 * MK20D5 FTFL
 *
 * Flash Memory Interface
 *
 * Registers defined in this header file:
 * - FTFL_FSTAT - Flash Status Register
 * - FTFL_FCNFG - Flash Configuration Register
 * - FTFL_FSEC - Flash Security Register
 * - FTFL_FOPT - Flash Option Register
 * - FTFL_FCCOB3 - Flash Common Command Object Registers
 * - FTFL_FCCOB2 - Flash Common Command Object Registers
 * - FTFL_FCCOB1 - Flash Common Command Object Registers
 * - FTFL_FCCOB0 - Flash Common Command Object Registers
 * - FTFL_FCCOB7 - Flash Common Command Object Registers
 * - FTFL_FCCOB6 - Flash Common Command Object Registers
 * - FTFL_FCCOB5 - Flash Common Command Object Registers
 * - FTFL_FCCOB4 - Flash Common Command Object Registers
 * - FTFL_FCCOBB - Flash Common Command Object Registers
 * - FTFL_FCCOBA - Flash Common Command Object Registers
 * - FTFL_FCCOB9 - Flash Common Command Object Registers
 * - FTFL_FCCOB8 - Flash Common Command Object Registers
 * - FTFL_FPROT3 - Program Flash Protection Registers
 * - FTFL_FPROT2 - Program Flash Protection Registers
 * - FTFL_FPROT1 - Program Flash Protection Registers
 * - FTFL_FPROT0 - Program Flash Protection Registers
 * - FTFL_FEPROT - EEPROM Protection Register
 * - FTFL_FDPROT - Data Flash Protection Register
 */

#define FTFL_INSTANCE_COUNT (1U) /*!< Number of instances of the FTFL module. */
#define FTFL_IDX (0U) /*!< Instance number for FTFL. */

/*******************************************************************************
 * FTFL_FSTAT - Flash Status Register
 ******************************************************************************/

/*!
 * @brief FTFL_FSTAT - Flash Status Register (RW)
 *
 * Reset value: 0x00U
 *
 * The FSTAT register reports the operational status of the FTFL module. The
 * CCIF, RDCOLERR, ACCERR, and FPVIOL bits are readable and writable. The MGSTAT0
 * bit is read only. The unassigned bits read 0 and are not writable. When set, the
 * Access Error (ACCERR) and Flash Protection Violation (FPVIOL) bits in this
 * register prevent the launch of any more commands until the flag is cleared (by
 * writing a one to it).
 */
/*!
 * @name Constants and macros for entire FTFL_FSTAT register
 */
/*@{*/
#define FTFL_RD_FSTAT(base)      (FTFL_FSTAT_REG(base))
#define FTFL_WR_FSTAT(base, value) (FTFL_FSTAT_REG(base) = (value))
#define FTFL_RMW_FSTAT(base, mask, value) (FTFL_WR_FSTAT(base, (FTFL_RD_FSTAT(base) & ~(mask)) | (value)))
#define FTFL_SET_FSTAT(base, value) (FTFL_WR_FSTAT(base, FTFL_RD_FSTAT(base) |  (value)))
#define FTFL_CLR_FSTAT(base, value) (FTFL_WR_FSTAT(base, FTFL_RD_FSTAT(base) & ~(value)))
#define FTFL_TOG_FSTAT(base, value) (FTFL_WR_FSTAT(base, FTFL_RD_FSTAT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FSTAT bitfields
 */

/*!
 * @name Register FTFL_FSTAT, field MGSTAT0[0] (RO)
 *
 * The MGSTAT0 status flag is set if an error is detected during execution of an
 * FTFL command or during the flash reset sequence. As a status flag, this bit
 * cannot (and need not) be cleared by the user like the other error flags in this
 * register. The value of the MGSTAT0 bit for "command-N" is valid only at the
 * end of the "command-N" execution when CCIF=1 and before the next command has
 * been launched. At some point during the execution of "command-N+1," the previous
 * result is discarded and any previous error is cleared.
 */
/*@{*/
/*! @brief Read current value of the FTFL_FSTAT_MGSTAT0 field. */
#define FTFL_RD_FSTAT_MGSTAT0(base) ((FTFL_FSTAT_REG(base) & FTFL_FSTAT_MGSTAT0_MASK) >> FTFL_FSTAT_MGSTAT0_SHIFT)
#define FTFL_BRD_FSTAT_MGSTAT0(base) (BITBAND_ACCESS8(&FTFL_FSTAT_REG(base), FTFL_FSTAT_MGSTAT0_SHIFT))
/*@}*/

/*!
 * @name Register FTFL_FSTAT, field FPVIOL[4] (W1C)
 *
 * The FPVIOL error bit indicates an attempt was made to program or erase an
 * address in a protected area of program flash or data flash memory during a
 * command write sequence or a write was attempted to a protected area of the FlexRAM
 * while enabled for EEPROM . While FPVIOL is set, the CCIF flag cannot be cleared
 * to launch a command. The FPVIOL bit is cleared by writing a 1 to it. Writing
 * a 0 to the FPVIOL bit has no effect.
 *
 * Values:
 * - 0 - No protection violation detected
 * - 1 - Protection violation detected
 */
/*@{*/
/*! @brief Read current value of the FTFL_FSTAT_FPVIOL field. */
#define FTFL_RD_FSTAT_FPVIOL(base) ((FTFL_FSTAT_REG(base) & FTFL_FSTAT_FPVIOL_MASK) >> FTFL_FSTAT_FPVIOL_SHIFT)
#define FTFL_BRD_FSTAT_FPVIOL(base) (BITBAND_ACCESS8(&FTFL_FSTAT_REG(base), FTFL_FSTAT_FPVIOL_SHIFT))

/*! @brief Set the FPVIOL field to a new value. */
#define FTFL_WR_FSTAT_FPVIOL(base, value) (FTFL_RMW_FSTAT(base, (FTFL_FSTAT_FPVIOL_MASK | FTFL_FSTAT_ACCERR_MASK | FTFL_FSTAT_RDCOLERR_MASK | FTFL_FSTAT_CCIF_MASK), FTFL_FSTAT_FPVIOL(value)))
#define FTFL_BWR_FSTAT_FPVIOL(base, value) (BITBAND_ACCESS8(&FTFL_FSTAT_REG(base), FTFL_FSTAT_FPVIOL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTFL_FSTAT, field ACCERR[5] (W1C)
 *
 * The ACCERR error bit indicates an illegal access has occurred to an FTFL
 * resource caused by a violation of the command write sequence or issuing an illegal
 * FTFL command. While ACCERR is set, the CCIF flag cannot be cleared to launch
 * a command. The ACCERR bit is cleared by writing a 1 to it. Writing a 0 to the
 * ACCERR bit has no effect.
 *
 * Values:
 * - 0 - No access error detected
 * - 1 - Access error detected
 */
/*@{*/
/*! @brief Read current value of the FTFL_FSTAT_ACCERR field. */
#define FTFL_RD_FSTAT_ACCERR(base) ((FTFL_FSTAT_REG(base) & FTFL_FSTAT_ACCERR_MASK) >> FTFL_FSTAT_ACCERR_SHIFT)
#define FTFL_BRD_FSTAT_ACCERR(base) (BITBAND_ACCESS8(&FTFL_FSTAT_REG(base), FTFL_FSTAT_ACCERR_SHIFT))

