ARMmbed/DAPLink/source/hif_hal/freescale/iap/devices/MK20D5/MK20D5_extension.h
/*! @brief Set the TSIEN field to a new value. */
#define TSI_WR_GENCS_TSIEN(base, value) (TSI_RMW_GENCS(base, TSI_GENCS_TSIEN_MASK, TSI_GENCS_TSIEN(value)))
#define TSI_BWR_GENCS_TSIEN(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_TSIEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field SWTS[8] (WO)
 *
 * Write a "1" to this bit will start a scan sequence and write a "0" to this
 * bit has no effect.
 */
/*@{*/
/*! @brief Set the SWTS field to a new value. */
#define TSI_WR_GENCS_SWTS(base, value) (TSI_RMW_GENCS(base, TSI_GENCS_SWTS_MASK, TSI_GENCS_SWTS(value)))
#define TSI_BWR_GENCS_SWTS(base, value) (TSI_WR_GENCS_SWTS(base, value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field SCNIP[9] (RO)
 *
 * "1" indicates a scanning process is in progress,this bit is read-only and
 * changes automatically by the TSI model.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_SCNIP field. */
#define TSI_RD_GENCS_SCNIP(base) ((TSI_GENCS_REG(base) & TSI_GENCS_SCNIP_MASK) >> TSI_GENCS_SCNIP_SHIFT)
#define TSI_BRD_GENCS_SCNIP(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_SCNIP_SHIFT))
/*@}*/

/*!
 * @name Register TSI_GENCS, field OVRF[12] (RW)
 *
 * Values:
 * - 0 - No over run.
 * - 1 - Over Run occurred.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_OVRF field. */
#define TSI_RD_GENCS_OVRF(base) ((TSI_GENCS_REG(base) & TSI_GENCS_OVRF_MASK) >> TSI_GENCS_OVRF_SHIFT)
#define TSI_BRD_GENCS_OVRF(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_OVRF_SHIFT))

/*! @brief Set the OVRF field to a new value. */
#define TSI_WR_GENCS_OVRF(base, value) (TSI_RMW_GENCS(base, TSI_GENCS_OVRF_MASK, TSI_GENCS_OVRF(value)))
#define TSI_BWR_GENCS_OVRF(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_OVRF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field EXTERF[13] (RW)
 *
 * This flag is set when an active electrode has a result register either 0x0000
 * or 0xFFFF. Write "1", when this flag is set, to clear it..
 *
 * Values:
 * - 0 - No fault happend on TSI electrodes
 * - 1 - Short to VDD or VSS was detected on one or more electrodes.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_EXTERF field. */
#define TSI_RD_GENCS_EXTERF(base) ((TSI_GENCS_REG(base) & TSI_GENCS_EXTERF_MASK) >> TSI_GENCS_EXTERF_SHIFT)
#define TSI_BRD_GENCS_EXTERF(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_EXTERF_SHIFT))

/*! @brief Set the EXTERF field to a new value. */
#define TSI_WR_GENCS_EXTERF(base, value) (TSI_RMW_GENCS(base, TSI_GENCS_EXTERF_MASK, TSI_GENCS_EXTERF(value)))
#define TSI_BWR_GENCS_EXTERF(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_EXTERF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field OUTRGF[14] (RW)
 *
 * This flag is set if the result register of the low power enabled electrode is
 * outside the range defined by the TSI_THRESHOLD register. This flag is only
 * set when the TSI is in low power mode. It can be read once the CPU wakes up.
 * Write "1" , when this flag is set, to clear it..
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_OUTRGF field. */
#define TSI_RD_GENCS_OUTRGF(base) ((TSI_GENCS_REG(base) & TSI_GENCS_OUTRGF_MASK) >> TSI_GENCS_OUTRGF_SHIFT)
#define TSI_BRD_GENCS_OUTRGF(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_OUTRGF_SHIFT))

/*! @brief Set the OUTRGF field to a new value. */
#define TSI_WR_GENCS_OUTRGF(base, value) (TSI_RMW_GENCS(base, TSI_GENCS_OUTRGF_MASK, TSI_GENCS_OUTRGF(value)))
#define TSI_BWR_GENCS_OUTRGF(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_OUTRGF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field EOSF[15] (RW)
 *
 * This flag is set when all active electrodes are scanned is ended after a scan
 * trigger. Write "1" , when this flag is set, to clear it..
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_EOSF field. */
#define TSI_RD_GENCS_EOSF(base) ((TSI_GENCS_REG(base) & TSI_GENCS_EOSF_MASK) >> TSI_GENCS_EOSF_SHIFT)
#define TSI_BRD_GENCS_EOSF(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_EOSF_SHIFT))

/*! @brief Set the EOSF field to a new value. */
#define TSI_WR_GENCS_EOSF(base, value) (TSI_RMW_GENCS(base, TSI_GENCS_EOSF_MASK, TSI_GENCS_EOSF(value)))
#define TSI_BWR_GENCS_EOSF(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_EOSF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field PS[18:16] (RW)
 *
 * This bit-field can only be changed if the TSI module is disabled (TSIEN bit =
 * 0)
 *
 * Values:
 * - 000 - Electrode Oscillator Frequency divided by 1
 * - 001 - Electrode Oscillator Frequency divided by 2
 * - 010 - Electrode Oscillator Frequency divided by 4
 * - 011 - Electrode Oscillator Frequency divided by 8
 * - 100 - Electrode Oscillator Frequency divided by 16
 * - 101 - Electrode Oscillator Frequency divided by 32
 * - 110 - Electrode Oscillator Frequency divided by 64
 * - 111 - Electrode Oscillator Frequency divided by 128
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_PS field. */
#define TSI_RD_GENCS_PS(base) ((TSI_GENCS_REG(base) & TSI_GENCS_PS_MASK) >> TSI_GENCS_PS_SHIFT)
#define TSI_BRD_GENCS_PS(base) (TSI_RD_GENCS_PS(base))

/*! @brief Set the PS field to a new value. */
#define TSI_WR_GENCS_PS(base, value) (TSI_RMW_GENCS(base, TSI_GENCS_PS_MASK, TSI_GENCS_PS(value)))
#define TSI_BWR_GENCS_PS(base, value) (TSI_WR_GENCS_PS(base, value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field NSCN[23:19] (RW)
 *
 * This bit-field can only be changed if the TSI module is disabled (TSIEN bit =
 * 0).
 *
 * Values:
 * - 00000 - Once per electrode
 * - 00001 - Twice per electrode
 * - 00010 - 3 times per electrode
 * - 00011 - 4 times per electrode
 * - 00100 - 5 times per electrode
 * - 00101 - 6 times per electrode
 * - 00110 - 7 times per electrode
 * - 00111 - 8 times per electrode
 * - 01000 - 9 times per electrode
 * - 01001 - 10 times per electrode
 * - 01010 - 11 times per electrode
 * - 01011 - 12 times per electrode
 * - 01100 - 13 times per electrode
 * - 01101 - 14 times per electrode
 * - 01110 - 15 times per electrode
 * - 01111 - 16 times per electrode
 * - 10000 - 17 times per electrode
 * - 10001 - 18 times per electrode
 * - 10010 - 19 times per electrode
 * - 10011 - 20 times per electrode
 * - 10100 - 21 times per electrode
 * - 10101 - 22 times per electrode
 * - 10110 - 23 times per electrode
 * - 10111 - 24 times per electrode
 * - 11000 - 25 times per electrode
 * - 11001 - 26 times per electrode
 * - 11010 - 27 times per electrode
 * - 11011 - 28 times per electrode
 * - 11100 - 29 times per electrode
 * - 11101 - 30 times per electrode
 * - 11110 - 31 times per electrode
 * - 11111 - 32 times per electrode
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_NSCN field. */
#define TSI_RD_GENCS_NSCN(base) ((TSI_GENCS_REG(base) & TSI_GENCS_NSCN_MASK) >> TSI_GENCS_NSCN_SHIFT)
#define TSI_BRD_GENCS_NSCN(base) (TSI_RD_GENCS_NSCN(base))

/*! @brief Set the NSCN field to a new value. */
#define TSI_WR_GENCS_NSCN(base, value) (TSI_RMW_GENCS(base, TSI_GENCS_NSCN_MASK, TSI_GENCS_NSCN(value)))
#define TSI_BWR_GENCS_NSCN(base, value) (TSI_WR_GENCS_NSCN(base, value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field LPSCNITV[27:24] (RW)
 *
 * This bit-field can only be changed if the TSI module is disabled (TSIEN bit =
 * 0).
 *
 * Values:
 * - 0000 - 1 ms scan interval
 * - 0001 - 5 ms scan interval
 * - 0010 - 10 ms scan interval
 * - 0011 - 15 ms scan interval
 * - 0100 - 20 ms scan interval
 * - 0101 - 30 ms scan interval
 * - 0110 - 40 ms scan interval
 * - 0111 - 50 ms scan interval
 * - 1000 - 75 ms scan interval
 * - 1001 - 100 ms scan interval
 * - 1010 - 125 ms scan interval
 * - 1011 - 150 ms scan interval
 * - 1100 - 200 ms scan interval
 * - 1101 - 300 ms scan interval
 * - 1110 - 400 ms scan interval
 * - 1111 - 500 ms scan interval
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_LPSCNITV field. */
#define TSI_RD_GENCS_LPSCNITV(base) ((TSI_GENCS_REG(base) & TSI_GENCS_LPSCNITV_MASK) >> TSI_GENCS_LPSCNITV_SHIFT)
#define TSI_BRD_GENCS_LPSCNITV(base) (TSI_RD_GENCS_LPSCNITV(base))

/*! @brief Set the LPSCNITV field to a new value. */
#define TSI_WR_GENCS_LPSCNITV(base, value) (TSI_RMW_GENCS(base, TSI_GENCS_LPSCNITV_MASK, TSI_GENCS_LPSCNITV(value)))
#define TSI_BWR_GENCS_LPSCNITV(base, value) (TSI_WR_GENCS_LPSCNITV(base, value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field LPCLKS[28] (RW)
 *
 * This bit-field can only be changed if the TSI module is disabled (TSIEN bit =
 * 0).
 *
 * Values:
 * - 0 - LPOCLK is selected to determine the scan period in low power mode
 * - 1 - VLPOSCCLK is selected to determine the scan period in low power mode
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_LPCLKS field. */
#define TSI_RD_GENCS_LPCLKS(base) ((TSI_GENCS_REG(base) & TSI_GENCS_LPCLKS_MASK) >> TSI_GENCS_LPCLKS_SHIFT)
#define TSI_BRD_GENCS_LPCLKS(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_LPCLKS_SHIFT))

/*! @brief Set the LPCLKS field to a new value. */
#define TSI_WR_GENCS_LPCLKS(base, value) (TSI_RMW_GENCS(base, TSI_GENCS_LPCLKS_MASK, TSI_GENCS_LPCLKS(value)))
#define TSI_BWR_GENCS_LPCLKS(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_LPCLKS_SHIFT) = (value))
/*@}*/

