ARMmbed/DAPLink/source/hif_hal/freescale/iap/devices/MK20D5/MK20D5_extension.h
/*******************************************************************************
 * TSI_CNTR3 - Counter Register
 ******************************************************************************/

/*!
 * @brief TSI_CNTR3 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_CNTR3 register
 */
/*@{*/
#define TSI_RD_CNTR3(base)       (TSI_CNTR3_REG(base))
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR3 bitfields
 */

/*!
 * @name Register TSI_CNTR3, field CTN1[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR3_CTN1 field. */
#define TSI_RD_CNTR3_CTN1(base) ((TSI_CNTR3_REG(base) & TSI_CNTR3_CTN1_MASK) >> TSI_CNTR3_CTN1_SHIFT)
#define TSI_BRD_CNTR3_CTN1(base) (TSI_RD_CNTR3_CTN1(base))
/*@}*/

/*!
 * @name Register TSI_CNTR3, field CTN[31:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR3_CTN field. */
#define TSI_RD_CNTR3_CTN(base) ((TSI_CNTR3_REG(base) & TSI_CNTR3_CTN_MASK) >> TSI_CNTR3_CTN_SHIFT)
#define TSI_BRD_CNTR3_CTN(base) (TSI_RD_CNTR3_CTN(base))
/*@}*/

/*******************************************************************************
 * TSI_CNTR5 - Counter Register
 ******************************************************************************/

/*!
 * @brief TSI_CNTR5 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_CNTR5 register
 */
/*@{*/
#define TSI_RD_CNTR5(base)       (TSI_CNTR5_REG(base))
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR5 bitfields
 */

/*!
 * @name Register TSI_CNTR5, field CTN1[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR5_CTN1 field. */
#define TSI_RD_CNTR5_CTN1(base) ((TSI_CNTR5_REG(base) & TSI_CNTR5_CTN1_MASK) >> TSI_CNTR5_CTN1_SHIFT)
#define TSI_BRD_CNTR5_CTN1(base) (TSI_RD_CNTR5_CTN1(base))
/*@}*/

/*!
 * @name Register TSI_CNTR5, field CTN[31:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR5_CTN field. */
#define TSI_RD_CNTR5_CTN(base) ((TSI_CNTR5_REG(base) & TSI_CNTR5_CTN_MASK) >> TSI_CNTR5_CTN_SHIFT)
#define TSI_BRD_CNTR5_CTN(base) (TSI_RD_CNTR5_CTN(base))
/*@}*/

/*******************************************************************************
 * TSI_CNTR7 - Counter Register
 ******************************************************************************/

/*!
 * @brief TSI_CNTR7 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_CNTR7 register
 */
/*@{*/
#define TSI_RD_CNTR7(base)       (TSI_CNTR7_REG(base))
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR7 bitfields
 */

/*!
 * @name Register TSI_CNTR7, field CTN1[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR7_CTN1 field. */
#define TSI_RD_CNTR7_CTN1(base) ((TSI_CNTR7_REG(base) & TSI_CNTR7_CTN1_MASK) >> TSI_CNTR7_CTN1_SHIFT)
#define TSI_BRD_CNTR7_CTN1(base) (TSI_RD_CNTR7_CTN1(base))
/*@}*/

/*!
 * @name Register TSI_CNTR7, field CTN[31:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR7_CTN field. */
#define TSI_RD_CNTR7_CTN(base) ((TSI_CNTR7_REG(base) & TSI_CNTR7_CTN_MASK) >> TSI_CNTR7_CTN_SHIFT)
#define TSI_BRD_CNTR7_CTN(base) (TSI_RD_CNTR7_CTN(base))
/*@}*/

/*******************************************************************************
 * TSI_CNTR9 - Counter Register
 ******************************************************************************/

/*!
 * @brief TSI_CNTR9 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_CNTR9 register
 */
/*@{*/
#define TSI_RD_CNTR9(base)       (TSI_CNTR9_REG(base))
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR9 bitfields
 */

/*!
 * @name Register TSI_CNTR9, field CTN1[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR9_CTN1 field. */
#define TSI_RD_CNTR9_CTN1(base) ((TSI_CNTR9_REG(base) & TSI_CNTR9_CTN1_MASK) >> TSI_CNTR9_CTN1_SHIFT)
#define TSI_BRD_CNTR9_CTN1(base) (TSI_RD_CNTR9_CTN1(base))
/*@}*/

/*!
 * @name Register TSI_CNTR9, field CTN[31:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR9_CTN field. */
#define TSI_RD_CNTR9_CTN(base) ((TSI_CNTR9_REG(base) & TSI_CNTR9_CTN_MASK) >> TSI_CNTR9_CTN_SHIFT)
#define TSI_BRD_CNTR9_CTN(base) (TSI_RD_CNTR9_CTN(base))
/*@}*/

/*******************************************************************************
 * TSI_CNTR11 - Counter Register
 ******************************************************************************/

/*!
 * @brief TSI_CNTR11 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_CNTR11 register
 */
/*@{*/
#define TSI_RD_CNTR11(base)      (TSI_CNTR11_REG(base))
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR11 bitfields
 */

/*!
 * @name Register TSI_CNTR11, field CTN1[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR11_CTN1 field. */
#define TSI_RD_CNTR11_CTN1(base) ((TSI_CNTR11_REG(base) & TSI_CNTR11_CTN1_MASK) >> TSI_CNTR11_CTN1_SHIFT)
#define TSI_BRD_CNTR11_CTN1(base) (TSI_RD_CNTR11_CTN1(base))
/*@}*/

/*!
 * @name Register TSI_CNTR11, field CTN[31:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR11_CTN field. */
#define TSI_RD_CNTR11_CTN(base) ((TSI_CNTR11_REG(base) & TSI_CNTR11_CTN_MASK) >> TSI_CNTR11_CTN_SHIFT)
#define TSI_BRD_CNTR11_CTN(base) (TSI_RD_CNTR11_CTN(base))
/*@}*/

/*******************************************************************************
 * TSI_CNTR13 - Counter Register
 ******************************************************************************/

/*!
 * @brief TSI_CNTR13 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_CNTR13 register
 */
/*@{*/
#define TSI_RD_CNTR13(base)      (TSI_CNTR13_REG(base))
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR13 bitfields
 */

/*!
 * @name Register TSI_CNTR13, field CTN1[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR13_CTN1 field. */
#define TSI_RD_CNTR13_CTN1(base) ((TSI_CNTR13_REG(base) & TSI_CNTR13_CTN1_MASK) >> TSI_CNTR13_CTN1_SHIFT)
#define TSI_BRD_CNTR13_CTN1(base) (TSI_RD_CNTR13_CTN1(base))
/*@}*/

/*!
 * @name Register TSI_CNTR13, field CTN[31:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR13_CTN field. */
#define TSI_RD_CNTR13_CTN(base) ((TSI_CNTR13_REG(base) & TSI_CNTR13_CTN_MASK) >> TSI_CNTR13_CTN_SHIFT)
#define TSI_BRD_CNTR13_CTN(base) (TSI_RD_CNTR13_CTN(base))
/*@}*/

