ARMmbed/DAPLink/source/hif_hal/freescale/iap/devices/MK20D5/MK20D5_extension.h
/*******************************************************************************
 * UART_S1 - UART Status Register 1
 ******************************************************************************/

/*!
 * @brief UART_S1 - UART Status Register 1 (RO)
 *
 * Reset value: 0xC0U
 *
 * The S1 register provides inputs to the MCU for generation of UART interrupts
 * or DMA requests. This register can also be polled by the MCU to check the
 * status of these bits. To clear a flag, the status register should be read followed
 * by a read or write (depending on interrupt flag type) to the UART Data
 * Register. Other instructions can be executed between the two steps as long as it
 * does not compromise the handling of I/O, but the order of operations is important
 * for flag clearing. When a flag is configured to trigger a DMA request,
 * assertion of the associated DMA done signal from the DMA controller, clears the
 * flag. If the condition that results in the assertion of the flag, interrupt or DMA
 * request is not resolved prior to clearing the flag, the flag (and
 * interrupt/DMA request) will reassert. For example, if the DMA or interrupt service
 * routine failed to write sufficient data to the transmit buffer to raise it above the
 * watermark level, the flag will reassert and generate another interrupt or DMA
 * request. Reading an empty data register to clear one of these flags causes
 * the FIFO pointers to get out of alignment. A receive FIFO flush reinitializes
 * the pointers.
 */
/*!
 * @name Constants and macros for entire UART_S1 register
 */
/*@{*/
#define UART_RD_S1(base)         (UART_S1_REG(base))
/*@}*/

/*
 * Constants & macros for individual UART_S1 bitfields
 */

/*!
 * @name Register UART_S1, field PF[0] (RO)
 *
 * PF is set when PE is set, S2[LBKDE] is disabled, and the parity of the
 * received data does not match its parity bit. The PF is not set in the case of an
 * overrun condition. When the PF bit is set it only indicates that a dataword was
 * received with parity error since the last time it was cleared. There is no
 * guarantee that the first dataword read from the receive buffer has a parity error
 * or that there is only one dataword in the buffer that was received with a
 * parity error unless the receive buffer was a depth of one. To clear PF, read S1
 * and then read the UART data register (D). Within the receive buffer structure
 * the received dataword is tagged if it was received with a parity error. That
 * information is available by reading the ED register prior to reading the D
 * register. When EN709 is set/enabled parity error flag is not set.
 *
 * Values:
 * - 0 - No parity error has been detected since the last time this flag was
 *     cleared. If the receive buffer has a depth greater than 1 then there may be
 *     data in the receive buffer what was received with a parity error.
 * - 1 - At least one dataword was received with a parity error since the last
 *     time this flag was cleared.
 */
/*@{*/
/*! @brief Read current value of the UART_S1_PF field. */
#define UART_RD_S1_PF(base)  ((UART_S1_REG(base) & UART_S1_PF_MASK) >> UART_S1_PF_SHIFT)
#define UART_BRD_S1_PF(base) (BITBAND_ACCESS8(&UART_S1_REG(base), UART_S1_PF_SHIFT))
/*@}*/

/*!
 * @name Register UART_S1, field FE[1] (RO)
 *
 * FE is set when a logic 0 is accepted as the stop bit. FE bit does not set in
 * the case of an overrun or while the LIN break detect feature is enabled
 * (S2[LBKDE] = 1). FE inhibits further data reception until it is cleared. To clear
 * FE, read S1 with FE set and then read the UART data register (D). The last data
 * in the receive buffer represents the data that was received with the frame
 * error enabled. However, framing errors are not supported when 7816E is
 * set/enabled. However, if this flag is set, data will still not be received in 7816 mode.
 * Framing errors are not supported in 709 mode.
 *
 * Values:
 * - 0 - No framing error detected.
 * - 1 - Framing error.
 */
/*@{*/
/*! @brief Read current value of the UART_S1_FE field. */
#define UART_RD_S1_FE(base)  ((UART_S1_REG(base) & UART_S1_FE_MASK) >> UART_S1_FE_SHIFT)
#define UART_BRD_S1_FE(base) (BITBAND_ACCESS8(&UART_S1_REG(base), UART_S1_FE_SHIFT))
/*@}*/

/*!
 * @name Register UART_S1, field NF[2] (RO)
 *
 * NF is set when the UART detects noise on the receiver input. NF bit does not
 * get set in the case of an overrun or while the LIN break detect feature is
 * enabled (S2[LBKDE] = 1). When NF is set, it only indicates that a dataword has
 * been received with noise since the last time it was cleared. There is no
 * guarantee that the first dataword read from the receive buffer has noise or that
 * there is only one dataword in the buffer that was received with noise unless the
 * receive buffer has a depth of one. To clear NF, read S1 and then read the UART
 * data register (D). When EN709 is set/enabled, noise flag is not set.
 *
 * Values:
 * - 0 - No noise detected since the last time this flag was cleared. If the
 *     receive buffer has a depth greater than 1 then there may be data in the
 *     receiver buffer that was received with noise.
 * - 1 - At least one dataword was received with noise detected since the last
 *     time the flag was cleared.
 */
/*@{*/
/*! @brief Read current value of the UART_S1_NF field. */
#define UART_RD_S1_NF(base)  ((UART_S1_REG(base) & UART_S1_NF_MASK) >> UART_S1_NF_SHIFT)
#define UART_BRD_S1_NF(base) (BITBAND_ACCESS8(&UART_S1_REG(base), UART_S1_NF_SHIFT))
/*@}*/

/*!
 * @name Register UART_S1, field OR[3] (RO)
 *
 * OR is set when software fails to prevent the receive data register from
 * overflowing with data. The OR bit is set immediately after the stop bit has been
 * completely received for the dataword that overflows the buffer and all the other
 * error flags (FE,NF and PF) are prevented from setting. The data in the shift
 * register is lost, but the data already in the UART data registers is not
 * affected. If the OR flag is set, no data will be stored in the data buffer even if
 * sufficient room exists. Additionally, while the OR flag is set the RDRF flag,
 * and IDLE flags will be blocked from asserting, i.e. transition from an
 * inactive to an active state. To clear OR, read S1 when OR is set and then read UART
 * data register (D). If LBKDE is enabled and a LIN Break is detected, the OR bit
 * will assert if the S2[LBKDIF] flag is not cleared before the next data
 * character is received.See Overrun (OR) flag implications for more details regarding
 * the operation of the OR bit. In 7816 mode, it is possible to configure a NACK
 * to be returned by programing the C7816[ONACK] bit.
 *
 * Values:
 * - 0 - No overrun has occurred since the last time the flag was cleared.
 * - 1 - Overrun has occurred or the overrun flag has not been cleared since the
 *     last overrun occured.
 */
/*@{*/
/*! @brief Read current value of the UART_S1_OR field. */
#define UART_RD_S1_OR(base)  ((UART_S1_REG(base) & UART_S1_OR_MASK) >> UART_S1_OR_SHIFT)
#define UART_BRD_S1_OR(base) (BITBAND_ACCESS8(&UART_S1_REG(base), UART_S1_OR_SHIFT))
/*@}*/

/*!
 * @name Register UART_S1, field IDLE[4] (RO)
 *
 * IDLE is set when 10 consecutive logic 1s (if C1[M] = 0), 11 consecutive logic
 * 1s (if C1[M] = 1 and C4[M10] = 0), or 12 consecutive logic 1s (if C1[M] = 1,
 * C4[M10] = 1, and C1[PE] = 1) appear on the receiver input. After the IDLE flag
 * is cleared, a frame must be received (although not necessarily stored in the
 * data buffer, for example if C2[RWU] is set) or a LIN break character must set
 * the S2[LBKDIF] flag before an idle condition can set the IDLE flag. To clear
 * IDLE, read UART status S1 with IDLE set and then read D. Idle detection is not
 * supported when 7816E or EN709 is set/enabled and hence this flag is ignored.
 * When the receiver wakeup bit (RWU) is set and WAKE is cleared, an idle line
 * condition sets the IDLE flag if RWUID is set, else the IDLE flag does not get set.
 *
 * Values:
 * - 0 - Receiver input is either active now or has never become active since
 *     the IDLE flag was last cleared.
 * - 1 - Receiver input has become idle or the flag has not been cleared since
 *     it last asserted.
 */
/*@{*/
/*! @brief Read current value of the UART_S1_IDLE field. */
#define UART_RD_S1_IDLE(base) ((UART_S1_REG(base) & UART_S1_IDLE_MASK) >> UART_S1_IDLE_SHIFT)
#define UART_BRD_S1_IDLE(base) (BITBAND_ACCESS8(&UART_S1_REG(base), UART_S1_IDLE_SHIFT))
/*@}*/

/*!
 * @name Register UART_S1, field RDRF[5] (RO)
 *
 * RDRF is set when the number of datawords in the receive buffer is equal to or
 * more than the number indicated by RWFIFO[RXWATER]. A dataword that is in the
 * process of being received is not included in the count. RDRF is prevented from
 * setting while S2[LBKDE] is set. Additionally, when S2[LBKDE] is set,
 * datawords that are received will be stored in the receive buffer but will over-write
 * each other. To clear RDRF, read S1 when RDRF is set and then read the UART data
 * register (D). For more efficient interrupt and DMA operation all data except
 * the final value is to be read from the buffer using D/C3[T8]/ED. The S1 should
 * then be read and the final data value read, resulting in the clearing of the
 * RDRF flag. Even if the RDRF flag is set, data will continue to be received
 * until an overrun condition occurs.
 *
 * Values:
 * - 0 - The number of datawords in the receive buffer is less than the number
 *     indicated by RXWATER.
 * - 1 - The number of datawords in the receive buffer is equal to or greater
 *     than the number indicated by RXWATER at some point in time since this flag
 *     was last cleared.
 */
/*@{*/
/*! @brief Read current value of the UART_S1_RDRF field. */
#define UART_RD_S1_RDRF(base) ((UART_S1_REG(base) & UART_S1_RDRF_MASK) >> UART_S1_RDRF_SHIFT)
#define UART_BRD_S1_RDRF(base) (BITBAND_ACCESS8(&UART_S1_REG(base), UART_S1_RDRF_SHIFT))
/*@}*/

/*!
 * @name Register UART_S1, field TC[6] (RO)
 *
 * TC is cleared when there is a transmission in progress or when a preamble or
 * break character is loaded. TC is set when the transmit buffer is empty and no
 * data, preamble, or break character is being transmitted. When TC is set, the
 * transmit data output signal becomes idle (logic 1). When 7816E is set/enabled
 * this bit is set after any NACK signal has been received but prior to any
 * corresponding guard times expiring. When EN709 is set/enabled this flag is not set
 * on transmit packet completion. TC is cleared by reading S1 with TC set and then
 * doing one of the following: Writing to the UART data register (D) to transmit
 * new data Queuing a preamble by clearing and then setting the C2[TE] bit.
 * Queuing a break character by writing 1 to SBK in C2
 *
 * Values:
 * - 0 - Transmitter active (sending data, a preamble, or a break).
 * - 1 - Transmitter idle (transmission activity complete).
 */
/*@{*/
/*! @brief Read current value of the UART_S1_TC field. */
#define UART_RD_S1_TC(base)  ((UART_S1_REG(base) & UART_S1_TC_MASK) >> UART_S1_TC_SHIFT)
#define UART_BRD_S1_TC(base) (BITBAND_ACCESS8(&UART_S1_REG(base), UART_S1_TC_SHIFT))
/*@}*/

/*!
 * @name Register UART_S1, field TDRE[7] (RO)
 *
 * TDRE will set when the number of datawords in the transmit buffer (D and
 * C3[T8])is equal to or less than the number indicated by TWFIFO[TXWATER]. A
 * character that is in the process of being transmitted is not included in the count.
 * To clear TDRE, read S1 when TDRE is set and then write to the UART data
 * register (D). For more efficient interrupt servicing all data except the final value
 * to be written to the buffer should written to D/C3[T8]. Then S1 can be read
 * before writing the final data value, resulting in the clearing of the TRDE flag.
 * This is more efficient since the TDRE will reassert until the watermark has
 * been exceeded so attempting to clear the TDRE every write will be ineffective
 * until sufficient data has been written.
 *
 * Values:
 * - 0 - The amount of data in the transmit buffer is greater than the value
 *     indicated by TWFIFO[TXWATER].
 * - 1 - The amount of data in the transmit buffer is less than or equal to the
 *     value indicated by TWFIFO[TXWATER] at some point in time since the flag
 *     has been cleared.
 */
/*@{*/
/*! @brief Read current value of the UART_S1_TDRE field. */
#define UART_RD_S1_TDRE(base) ((UART_S1_REG(base) & UART_S1_TDRE_MASK) >> UART_S1_TDRE_SHIFT)
#define UART_BRD_S1_TDRE(base) (BITBAND_ACCESS8(&UART_S1_REG(base), UART_S1_TDRE_SHIFT))
/*@}*/

